chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx775f512h.h
PLIB_INLINE SFR_DATA _USB_MODULE_BUSY_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USBBUSY_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_IN_SUSPEND_MODE_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USUSPEND_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_POWERED_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USBPWR_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_UnIR_VAL_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1IR_STALLIF_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_UnIE_VAL_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1IE_STALLIE_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_UnEIR_VAL_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EIR_BTSEF_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_UnEIE_VAL_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EIE_BTSEE_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LAST_ENDPOINT_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1STAT_ENDPT_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LAST_DIRECTION_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1STAT_DIR_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LAST_PING_PONG_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1STAT_PPBI_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LIVE_JSTATE_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_JSTATE_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LIVE_SE0_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_SE0_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_PACKET_XFER_DISABLED_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PKTDIS_TOKBUSY_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_BUSY_WITH_TOKEN_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PKTDIS_TOKBUSY_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_GENERATE_RESET_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBRST_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_HOST_ENABLE_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_HOSTEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_RESUME_SIGNALING_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_RESUME_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_FREEZE_BUFFERS_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PPBRST_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_DEVICE_ENABLE_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBEN_SOFEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_START_OF_FRAMES_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBEN_SOFEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_NEXT_TOKEN_LOWSPEED_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1ADDR_LSPDEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_DEVICE_ADDRESS_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1ADDR_DEVADDR_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_FRAME_NUMBER_7to0_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1FRML_FRML_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_FRAME_NUMBER_10to8_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1FRMH_FRMH_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_TOKEN_PID_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1TOK_PID_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_TOKEN_ENDPOINT_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1TOK_EP_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_SOF_COUNT_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1SOF_CNT_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_BDT_BASE_ADDR_15to09_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1BDTP1_BDTPTRL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_BDT_BASE_ADDR_23to16_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1BDTP2_BDTPTRH_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

